examples/workflows/parametric_sweep/solution_foam_dict/base_case_4/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

Ical            0.0474667;

kp              0.00337963;

internalField   uniform $kp;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       $Ical;
        value           uniform $kp;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $kp;
        value           uniform $kp;
    }
    ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
